{
  "alpha_pattern": {},
  "auto_mapping": {
    "base_model_class": "UNet2DConditionModel",
    "parent_library": "diffusers.models.unets.unet_2d_condition"
  },
  "base_model_name_or_path": null,
  "bias": "none",
  "eva_config": null,
  "exclude_modules": null,
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 16,
  "lora_bias": false,
  "lora_dropout": 0.1,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 4,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "attn1.to_k",
    "attn2.to_k",
    "attn2.to_out.0",
    "attn1.to_q",
    "attn2.to_q",
    "attn1.to_out.0",
    "attn2.to_v",
    "attn1.to_v"
  ],
  "task_type": null,
  "use_dora": false,
  "use_rslora": false
}